<?php

namespace Database\Seeders;

use App\Models\Hall;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class HallSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        //Hall::truncate();

        Hall::create([
            'name'=>'قاعة السعادة' ,
            'capacity'=> '25',
            'feature'=> 'مساحة القاعة 30 متر مربع|إمكانية عقد(دورات - ورش عمل)|قاعة مكيفة|شبكة إنترنت واي فاي|شاشة عرض كبيرة|ستاند اوراق|إمكانية ربط بث الياف للبث المباشر',
            'price'=> '100',
            'discount'=> 0 ,
            'is_avaliable'=> 1,
            'description'=> '15 شخص نظام طاولات مستديرة',
        ]);

        Hall::create([
            'name'=>'قاعة الهجرين' ,
            'capacity'=> '20',
            'feature'=> 'مساحة القاعة 60 متر مربع|إمكانية عقد(دورات - ندوات - ورش عمل)|تكييف مركزي|شبكة إنترنت واي فاي|جهاز صوتيات لاسلكي|شاشة عرض كبيرة|جهاز عرض بروجكتر|ستاند اوراق|إمكانية ربط بث الياف للبث المباشر',
            'price'=> '120',
            'discount'=> 0 ,
            'is_avaliable'=> 1,
            'description'=> '40 شخص نظام طاولات مستديرة',
        ]);

        Hall::create([
            'name'=>'قاعة الاستدامة' ,
            'capacity'=> '20',
            'feature'=> 'مساحة القاعة 130 متر مربع|إمكانية عقد(دورات - ندوات - ورش عمل)|تكييف مركزي|شبكة إنترنت واي فاي|جهاز صوتيات لاسلكي|إمكانية ربط بث الياف للبث المباشر|غرفة إعداد وتجهيز',
            'price'=> '120',
            'discount'=> 0 ,
            'is_avaliable'=> 1,
            'description'=> '',
        ]);


        Hall::create([
            'name'=>'القاعة الكبرى' ,
            'capacity'=> '300',
            'feature'=> 'مساحة القاعة 330 متر مربع|مسرح مزود بأجهزة عرض وصوت وإضاءة|إمكانية عقد(مؤتمرات - معارض - ندوات - ورش عمل)|تكييف مركزي|شبكة إنترنت واي فاي|جهاز صوتيات لاسلكي|إمكانية ربط بث الياف للبث المباشر|غرفة إعداد وتجهيز',
            'price'=> '120',
            'discount'=> 0 ,
            'is_avaliable'=> 1,
            'description'=> '300 شخص نظام حفل|100 شخص نظام طاولات مستديرة|120شخص نظام دوائر مع الضيوف|65 شخص نظام تباعد| 70شخص نظام حرف U|65 شخص نظام صفوف',
        ]);


        Hall::create([
            'name'=>'قاعة السلام' ,
            'capacity'=> '20',
            'feature'=> 'مساحة القاعة 130 متر مربع|إمكانية عقد(دورات - ندوات - ورش عمل)|تكييف مركزي|شبكة إنترنت واي فاي|جهاز صوتيات لاسلكي|إمكانية ربط بث الياف للبث المباشر|غرفة إعداد وتجهيز',
            'price'=> '120',
            'discount'=> 0 ,
            'is_avaliable'=> 1,
            'description'=> '',
        ]);

        Hall::create([
            'name'=>'قاعة شبام' ,
            'capacity'=> '20',
            'feature'=> 'مساحة القاعة 60 متر مربع|إمكانية عقد(دورات - ندوات - ورش عمل)|تكييف مركزي|شبكة إنترنت واي فاي|جهاز صوتيات لاسلكي|شاشة عرض كبيرة|جهاز عرض بروجكتر|سبورة ذكية تفاعلية|إمكانية ربط بث الياف للبث المباشر',
            'price'=> '120',
            'discount'=> 0 ,
            'is_avaliable'=> 1,
            'description'=> '40 شخص نظام طاولات مستديرة',
        ]);

        Hall::create([
            'name'=>'قاعة الاجتماعات' ,
            'capacity'=> '20',
            'feature'=> 'مساحة القاعة 60 متر مربع|تكييف مركزي|شبكة إنترنت واي فاي|غرفة إعداد وتجهيز',
            'price'=> '120',
            'discount'=> 0 ,
            'is_avaliable'=> 1,
            'description'=> '25 شخص',
        ]);

    }
}
